<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"395c736616b07940845081f567b258a7c72e813ee5a448aca3668f450d43505d","plan_job_ref":"Job Terraform Plan #66 at https://github.com/cal-itp/data-infra/actions/runs/14412165154","plan_out_hash":"23438e69fd8ef12198acd312be9e1558fa8c1f677cfef9e77746377fdf63694c","plan_hash":"efae78710d8cacf9ee0ac16ecb0bd19299e7ae1dca62b7d5c62c8b6935855c8e","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 8 to add, 0 to change, 7 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_project_iam_member.github-actions-service-account["roles/storage.admin"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/storage.admin"
    }

  # google_project_iam_member.github-actions-terraform["roles/editor"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/editor"
    }

  # google_project_iam_member.github-actions-terraform["roles/resourcemanager.projectIamAdmin"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_project_iam_member.github-actions-terraform["roles/storage.admin"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/storage.admin"
    }

  # google_project_iam_member.tfer--pytest-membership will be destroyed
  # (because google_project_iam_member.tfer--pytest-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--pytest-membership" {
-       etag    = "BwYwGdrVIec=" -> null
-       id      = "cal-itp-data-infra-staging/roles/storage.objectViewer/serviceAccount:github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/storage.objectViewer" -> null
    }

  # google_project_iam_member.tfer--terraform-membership["roles/editor"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYwGdrVIec=" -> null
-       id      = "cal-itp-data-infra-staging/roles/editor/serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/editor" -> null
    }

  # google_project_iam_member.tfer--terraform-membership["roles/resourcemanager.projectIamAdmin"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYwGdrVIec=" -> null
-       id      = "cal-itp-data-infra-staging/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/resourcemanager.projectIamAdmin" -> null
    }

  # google_project_iam_member.tfer--terraform-membership["roles/storage.admin"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYyTJz09SQ=" -> null
-       id      = "cal-itp-data-infra-staging/roles/storage.admin/serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra-staging" -> null
-       role    = "roles/storage.admin" -> null
    }

  # google_service_account.github-actions-service-account will be created
+   resource "google_service_account" "github-actions-service-account" {
+       account_id   = "******************************"
+       description  = "Service account for general Github Actions"
+       disabled     = false
+       display_name = "github_actions_services_account"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "cal-itp-data-infra-staging"
+       unique_id    = (known after apply)
    }

  # google_service_account.github-actions-terraform will be created
+   resource "google_service_account" "github-actions-terraform" {
+       account_id   = "************************"
+       description  = "Service account for Github Actions to run Terraform"
+       disabled     = false
+       display_name = "Terraform"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "cal-itp-data-infra-staging"
+       unique_id    = (known after apply)
    }

  # google_service_account.tfer--pytest will be destroyed
  # (because google_service_account.tfer--pytest is not in configuration)
-   resource "google_service_account" "tfer--pytest" {
-       account_id   = "github-actions-pytest" -> null
-       description  = "Service account for Github Actions to run tests" -> null
-       disabled     = false -> null
-       display_name = "pytest" -> null
-       email        = "github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       id           = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member       = "serviceAccount:github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       name         = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-pytest@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project      = "cal-itp-data-infra-staging" -> null
-       unique_id    = "112878807282408681248" -> null
    }

  # google_service_account.tfer--terraform will be destroyed
  # (because google_service_account.tfer--terraform is not in configuration)
-   resource "google_service_account" "tfer--terraform" {
-       account_id   = "github-actions-terraform" -> null
-       description  = "Service account for Github Actions to run Terraform" -> null
-       disabled     = false -> null
-       display_name = "Terraform" -> null
-       email        = "github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       id           = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       member       = "serviceAccount:github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       name         = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
-       project      = "cal-itp-data-infra-staging" -> null
-       unique_id    = "104530697444428508636" -> null
    }

  # google_service_account_iam_member.github-actions--service-account will be destroyed
  # (because google_service_account_iam_member.github-actions--service-account is not in configuration)
-   resource "google_service_account_iam_member" "github-actions--service-account" {
-       etag               = "BwYudKALq6k=" -> null
-       id                 = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/473674835135/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       member             = "principalSet://iam.googleapis.com/projects/473674835135/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       role               = "roles/iam.workloadIdentityUser" -> null
-       service_account_id = "projects/cal-itp-data-infra-staging/serviceAccounts/github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.github-actions-service-account will be created
+   resource "google_service_account_iam_member" "github-actions-service-account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "principalSet://iam.googleapis.com/projects/473674835135/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # google_service_account_iam_member.github-actions-terraform will be created
+   resource "google_service_account_iam_member" "github-actions-terraform" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "principalSet://iam.googleapis.com/projects/473674835135/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

Plan: 8 to add, 0 to change, 7 to destroy.

Changes to Outputs:
-   google_service_account_tfer--terraform_email                                                                                                                                                         = "github-actions-terraform@cal-itp-data-infra-staging.iam.gserviceaccount.com" -> null
```
</details>

:memo: Plan generated in [Terraform Plan #66](https://github.com/cal-itp/data-infra/actions/runs/14412165154)